Revit 2026 API

# LinkLoadContent Class

---

This class is used by IExternalResourceServers to return Link data to Revit when their LoadResource method is invoked. It also contains additional information used by IExternalResourceUIServers to display link load status results to the user.

SystemObject Autodesk.Revit.DBExternalResourceLoadContent Autodesk.Revit.DBLinkLoadContent

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LinkLoadContent : ExternalResourceLoadContent
```
```vb
Public Class LinkLoadContent
	Inherits ExternalResourceLoadContent
```
```cpp
public ref class LinkLoadContent : public ExternalResourceLoadContent
```
```fsharp
type LinkLoadContent =
    class
        inherit ExternalResourceLoadContent
    end
```

The LinkLoadContent type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ExternalResourceLoadContent) |
|  | LoadStatus | A value to indicate the status of an external resource load operation. IExternalResourceServers should set this in the LoadResource() method. (Inherited from ExternalResourceLoadContent) |
|  | Version | The version of the external data that the server is providing in this object. (Inherited from ExternalResourceLoadContent) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from ExternalResourceLoadContent) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLinkDataPath | Returns the Link data path owned by this LinkLoadContent object. |
|  | GetLinkLoadResult | Retrieves the LinkLoadResult of the attempt to load or reload a Revit link. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetLinkDataPath | Sets the Link data path owned by this LinkLoadContent object. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This class handles Revit links.

Revit links must be loaded from a path accessible to Revit. Server implementors should provide Revit with a ModelPath representing a location from which to load the link. Revit will handle the actual file loading.

Servers which represent non-local file locations will need to create their own implementation for copying or moving files to a Revit-accessible location.

The link data path used for link loading may be different from the path displayed to the user. The link data path represents the literal location of the file, whereas the link's display path represents what the user sees as the name of the link. See [!:Autodesk::Revit::DB::ExternalResourceReference::InSessionPath] for more details on display paths.

#### Reference

Autodesk.Revit.DB Namespace